20230123121710-exceptions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Exceptions</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Exceptions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgea9aaf2">1. Types of Exceptions</a>
<ul>
<li><a href="#org9463916">1.1. Checked</a></li>
<li><a href="#orgecca5ed">1.2. Unchecked</a></li>
<li><a href="#org1de0982">1.3. Errors</a></li>
</ul>
</li>
<li><a href="#org831b08b">2. Hierarchy</a></li>
<li><a href="#org0b3a26b">3. Catching Exceptions</a>
<ul>
<li><a href="#orged6ca9c">3.1. Single</a></li>
<li><a href="#org5ee7804">3.2. Multiple</a></li>
<li><a href="#org6298b84">3.3. Finally</a></li>
</ul>
</li>
<li><a href="#orgc3f1100">4. Throwing Exceptions</a>
<ul>
<li><a href="#org5d56d74">4.1. Unchecked Exception example</a></li>
<li><a href="#org9cd0f02">4.2. Checked Exception example</a></li>
</ul>
</li>
<li><a href="#org031d5e6">5. Custom Exceptions</a>
<ul>
<li><a href="#org3abf8bd">5.1. Chaining Exceptions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgea9aaf2" class="outline-2">
<h2 id="orgea9aaf2"><span class="section-number-2">1.</span> Types of Exceptions</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9463916" class="outline-3">
<h3 id="org9463916"><span class="section-number-3">1.1.</span> Checked</h3>
<div class="outline-text-3" id="text-1-1">
<p>
(Compile time) Developer should anticipate and handle errors
</p>

<div class="org-src-container">
<pre class="src src-java">var reader = new FileReader("file.txt"); // Throws: FileNotFoundException
</pre>
</div>
</div>
</div>

<div id="outline-container-orgecca5ed" class="outline-3">
<h3 id="orgecca5ed"><span class="section-number-3">1.2.</span> Unchecked</h3>
<div class="outline-text-3" id="text-1-2">
<p>
(Run time) <code>NullPointerException</code>
</p>
<div class="org-src-container">
<pre class="src src-java">public static void show(){
    sayHello(null);
}

public static void sayHello(String name) {
    System.out.println(name.toUpperCase());
}
</pre>
</div>

<p>
<code>ArithmeticException</code>: Divide by 0
<code>IllegalArgumentException</code>: invalid argument passed
<code>IndexOutOfBoundsException</code>: invalid index called in an array
</p>
</div>
</div>

<div id="outline-container-org1de0982" class="outline-3">
<h3 id="org1de0982"><span class="section-number-3">1.3.</span> Errors</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>StackOverflowError</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org831b08b" class="outline-2">
<h2 id="org831b08b"><span class="section-number-2">2.</span> Hierarchy</h2>
<div class="outline-text-2" id="text-2">
<p>
                        Throwable
  Exception(checked)                  Error
RuntimeException(unchecked)
</p>
</div>
</div>

<div id="outline-container-org0b3a26b" class="outline-2">
<h2 id="org0b3a26b"><span class="section-number-2">3.</span> Catching Exceptions</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orged6ca9c" class="outline-3">
<h3 id="orged6ca9c"><span class="section-number-3">3.1.</span> Single</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-java">try {
    var reader = new FileReader("file.txt");
} catch (FileNotFoundException e) {
    e.printStackTrace();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ee7804" class="outline-3">
<h3 id="org5ee7804"><span class="section-number-3">3.2.</span> Multiple</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-java">try {
    var reader = new FileReader("file.txt");
    var value = reader.read();
} catch (FileNotFoundException e) {
    e.printStackTrace();
} catch (IOException e) {
    e.printStackTrace();
}
</pre>
</div>

<p>
Note: (<code>FileNotFoundException</code> is derived from <code>IOException</code>) so we can catch both Exceptions in this case, i.e.:
</p>
<div class="org-src-container">
<pre class="src src-java">try {
    var reader = new FileReader("file.txt");
    var value = reader.read();
} catch (IOException e) {
    e.printStackTrace();
}
</pre>
</div>

<p>
Use <code>|</code> to inline exceptions, i.e:
</p>
<div class="org-src-container">
<pre class="src src-java">try {
    var reader = new FileReader("file.txt");
    var value = reader.read();
    new SimpleDateFormat().parse("");
} catch (IOException | ParseException e) {
    e.printStackTrace();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6298b84" class="outline-3">
<h3 id="org6298b84"><span class="section-number-3">3.3.</span> Finally</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Used to release external resources (File handles, network connections, DB Connections etc.)
</p>
<div class="org-src-container">
<pre class="src src-java">FileReader reader = null;
try {
    reader = new FileReader("file.txt");
    var value = reader.read();
} catch (IOException e) {
    e.printStackTrace();
} finally {
    if (reader != null) {
        try {
            reader.close();
        } catch (IOException e) {
            e.printStackTrace();
        }
    }
}
</pre>
</div>

<p>
<code>Note</code>: Above is not pretty, we can use <code>try with resources</code> statement to explicitly close connections.
</p>

<div class="org-src-container">
<pre class="src src-java">try (var reader = new FileReader("file.txt")){
    var value = reader.read();
} catch (IOException e) {
    e.printStackTrace();
}
// OR
try (
    var reader = new FileReader("file.txt");
    var writer = new FileWriter("somefile.txt");
){
    var value = reader.read();
} catch (IOException e) {
    e.printStackTrace();
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc3f1100" class="outline-2">
<h2 id="orgc3f1100"><span class="section-number-2">4.</span> Throwing Exceptions</h2>
<div class="outline-text-2" id="text-4">
<p>
Defensive programming: (Good for library or framework) Or Input from user
</p>
</div>
<div id="outline-container-org5d56d74" class="outline-3">
<h3 id="org5d56d74"><span class="section-number-3">4.1.</span> Unchecked Exception example</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-java">public void deposit(float value) {
 if(value &lt;= 0) throw new IllegalArgumentException();
 System.out.println("Deposited: " + value);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9cd0f02" class="outline-3">
<h3 id="org9cd0f02"><span class="section-number-3">4.2.</span> Checked Exception example</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-java">public void deposit(float value) throws IOException {
  if (value &lt;= 0) throw new IOException();
  System.out.println("Deposited: " + value);
}
</pre>
</div>

<p>
Then we handle it where used:
</p>
<div class="org-src-container">
<pre class="src src-java">public static void main(String[] args) {
    var account = new Account();
    try {
        account.deposit(-10);
    } catch (IOException e) {
        e.printStackTrace();
    }
}
</pre>
</div>

<p>
Re throwing error:
</p>
<div class="org-src-container">
<pre class="src src-java">public static void main(String[] args) throws IOException {
    var account = new Account();
    try {
        account.deposit(-10);
    } catch (Throwable e) { // or (Exception e)
        e.printStackTrace();
        throw e;
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org031d5e6" class="outline-2">
<h2 id="org031d5e6"><span class="section-number-2">5.</span> Custom Exceptions</h2>
<div class="outline-text-2" id="text-5">
<p>
<code>InsufficientFundsException.java</code>
</p>
<div class="org-src-container">
<pre class="src src-java">public class InsufficientFundsException extends Exception {
    public InsufficientFundsException(){
        super("Insufficient Funds in your account");
    }
    public InsufficientFundsException(String message){
        super(message);
    }
}
</pre>
</div>

<p>
<code>Account.java</code>
</p>
<div class="org-src-container">
<pre class="src src-java">public class Account {
   private float balance;
   public void deposit(float value) throws IOException {
    if (value &lt;= 0) throw new IOException();
    System.out.println("Deposited: " + value);
   }
    public void withdraw(float value) throws InsufficientFundsException {
        if (value &gt; balance) throw new InsufficientFundsException(); // OR with a provided message throw new InsufficientFundsException("Poor Twat");
    }
}
</pre>
</div>

<p>
<code>ExceptionsDemo.java</code>
</p>
<div class="org-src-container">
<pre class="src src-java">public class ExceptionsDemo {
    public static void show() {
        var account = new Account();
        try {
            account.withdraw(10);
        } catch (InsufficientFundsException e) {
            System.out.println(e.getMessage()); // Insufficient Funds in your account
        }
    }
}
</pre>
</div>
</div>

<div id="outline-container-org3abf8bd" class="outline-3">
<h3 id="org3abf8bd"><span class="section-number-3">5.1.</span> Chaining Exceptions</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Used a lot for libraries/framework code.
</p>

<p>
I.e. We can say <code>InsufficientFundsException</code> is derived from <code>AccountException</code>
<code>AccountException.java</code>
</p>
<div class="org-src-container">
<pre class="src src-java">public class AccountException extends Exception {
    public AccountException(Exception cause){
        super(cause);
    }
}
</pre>
</div>

<p>
<code>Account.java</code>
</p>
<div class="org-src-container">
<pre class="src src-java">public class Account {
   private float balance;
    public void withdraw(float value) throws AccountException {
        if (value &gt; balance)
          throw new AccountException(new InsufficientFundsException()); // InsufficientFundsException
    }
}
</pre>
</div>

<p>
Results in a nice stack trace when caught:
</p>
<div class="org-src-container">
<pre class="src src-java">com.exceptions.AccountException: com.exceptions.InsufficientFundsException: Insufficient Funds in your account
        at com.demo.Account.withdraw(Account.java:16)
        at com.exceptions.ExceptionsDemo.show(ExceptionsDemo.java:9)
        at com.demo.Main.main(Main.java:8)
Caused by: com.exceptions.InsufficientFundsException: Insufficient Funds in your account
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java">e.initCause();
var cause = e.getCause();
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
